InformationRegisters/ПолисыОМСФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПолисыОМСФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерПолиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ПолисыОМС/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает таблицу заполненную номерами ОМС и сроками их действия для физических лиц.
//
// Параметры:
//  СписокФизическихЛиц - Массив ссылок на элементы справочника физические лица или
//						  СправочникСсылка.ФизическиеЛица.
//	ДатаСведений		- дата на которую необходимо получить номера полисов ОМС физических лиц,
//						если дату не указывать, данные будут получены на текущую дату.
//
// Возвращаемое значение:
//	ТаблицаЗначений - Таблица значений, содержащая поля:
//		* ФизическоеЛицо	- СправочникСсылка.ФизическиеЛица
//		* НомерПолиса		- Строка
//		* ДатаОкончания		- Дата
//
Функция НомераОМС(СписокФизическихЛиц, ДатаСведений = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаСведений", ?(ДатаСведений = Неопределено, ТекущаяДатаСеанса(),ДатаСведений));
	Запрос.УстановитьПараметр("СписокФизическихЛиц", СписокФизическихЛиц);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПолисыОМСФизическихЛицСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПолисыОМСФизическихЛицСрезПоследних.НомерПолиса КАК НомерПолиса,
		|	ПолисыОМСФизическихЛицСрезПоследних.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	РегистрСведений.ПолисыОМСФизическихЛиц.СрезПоследних(&ДатаСведений, ФизическоеЛицо.Ссылка В (&СписокФизическихЛиц)) КАК ПолисыОМСФизическихЛицСрезПоследних";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ФизическиеЛицаПриСозданииНаСервере(Форма, ИмяГруппы) Экспорт
	
	ДобавитьРеквизитыСведенийДляРеестра(Форма);
	
	ДобавитьКомандуРедактированияСведенийДляРеестраГосслужащих(Форма, ИмяГруппы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьРеквизитыСведенийДляРеестра(Форма)
	
	МассивИменРеквизитовФормы = Новый Массив;
	ДобавляемыеРеквизиты = Новый Массив;
	ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, МассивИменРеквизитовФормы);
	
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ПолисыОМСФизическихЛиц", Новый ОписаниеТипов("РегистрСведенийМенеджерЗаписи.ПолисыОМСФизическихЛиц")));
	
	ЗарплатаКадры.ИзменитьРеквизитыФормы(Форма, ДобавляемыеРеквизиты, МассивИменРеквизитовФормы);
	
КонецПроцедуры

Процедура ДобавитьКомандуРедактированияСведенийДляРеестраГосслужащих(Форма, ИмяГруппы)

	// ЗУПК
	Возврат;
	// ЗУПК
	
	ИмяКоманды = "РедактированиеСведенийДляРеестраГосслужащих";
	
	Команда = Форма.Команды.Добавить(ИмяКоманды);
	Команда.Заголовок = НСтр("ru = 'Полисы ОМС'");
	Команда.Действие = "Подключаемый_ПолисыОМС";
	
	Группа = Форма.Элементы.Найти(ИмяГруппы);
		   
	Кнопка = Форма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Группа);
	Кнопка.Вид = ВидКнопкиФормы.Гиперссылка;
	Кнопка.ИмяКоманды = ИмяКоманды;
	
КонецПроцедуры

#КонецОбласти
